// 1. створити функцію яка обчислює та повертає площу прямокутника висотою
// let rectangle = (a,b) => a * b
// console.log(rectangle(5,9))

// 2. створити функцію яка обчислює та повертає площу кола
// let circle = (r) => 3.14 * r ** 2
// console.log(circle(9))

// 3. створити функцію яка обчислює та повертає площу циліндру
// let cylinder = (r,h) => 2*3.14*r*h
// console.log(cylinder(5,2))

// 4. створити функцію яка приймає масив та виводить кожен його елемент
// let array = (array) => array
// console.log(array([1,3,7]))

// 5. створити функцію яка  створює параграф з текстом. Текст задати через аргумент