// 1. Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
// let number1 = +prompt('Введіть перше число');
// let number2 = +prompt('Веедіть друге число');
// if (number1>number2) {
//     console.log(number1);
// }
// else if (number1<number2) {
//     console.log(number2);
// }
// else if (number1 === number2) {
//     console.log('Введені числа рівні')
// }


// 2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let number = +prompt('Введіть номер квартири')
// if (number >= 1 && number <= 20) {
//     console.log('Квартира знаходиться в під*їзді №1')
// } else if (number >= 21 && number <= 48) {
//     console.log('Квартира знаходиться у під*їзді №2')
// } else if (number >= 49 && number <= 90) {
//     console.log('Квартира знаходться у під*їзді №3')
// } else {
//     console.log('Даної квартири немає в цьому будинку')
// }

// 3. Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// let number = +prompt('Задайте числове значення');
// if (number === 10) {
// console.log('ВІРНО')
// } else {
//     console.log('НЕВІРНО')
// }

// 4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3,
// якщо об'єкт або масив - 3. якщо в змінну записали щось інше, спрацьовує else
// let x = ;
// if (typeof x == 'number') {
//     console.log('1')
// } else if (typeof x === 'string') {
//     console.log('2')
// } else if (typeof x === 'object' || typeof x === 'boolean') {
//     console.log('3')
// } else {
//     console.log('else')
// }

// 5.Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша температура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let temperature = +prompt('Температура повітря')
// if ( temperature >= 10 && temperature <= 22) {
//     console.log('Ми йдемо ВЧИТИСЯ')
// } else {
//     console.log('Сидимо вдома і вчимося онлайн')
// }

// 6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І в залежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let number = prompt('Введіть число від 1 до 5')
// switch (number) {
//     case '1' :
//         document.write('Ви виграли авто')
//         break;
//     case '2' :
//         document.write('Ви виграли мото')
//         break;
//     case '3' :
//         document.write('Ви виграли телефон')
//         break;
//     case '4' :
//         document.write('Ви виграли телевізор')
//         break;
//     case '5' :
//         document.write('Ви виграли ноутбук')
//         break;
//     default :
//         document.write('Число не вірне')
// }

