// 1. Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = +prompt('Введіть число')
// if (time >= 0 && time <= 15) {
//     console.log('Число попадає до 1 чверті години')
// } else if (time >= 16 && time <= 30) {
//     console.log('Число попадає до 2 чверті години')
// } else if (time >= 31 && time <= 45) {
//     console.log('Число попадає до 3 чверті години')
// } else if (time >= 46 && time <= 59) {
//     console.log('Число попадає до 4 чверті години')
// } else {
//     console.log('Не вірне число')
// }

// 2. У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = prompt('У яку половину місяця потрапляє число?')
// if (day >= 1 && day <= 10) {
//     console.log('Перша половина')
// } else if (day >= 11 && day <= 20) {
//     console.log('Друга половина')
// } else if (day >= 21 && day <= 31) {
//     console.log('Третя половина')
// } else {
//     console.log('Невірне число')
// }

// 3. У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test = confirm('Вам виповнилось 18?')
// if (test === true) {
//     console.log('Вірно')
// } else if (test === false) {
//     console.log('Неправильно')
// }
// Тернарний запис
// let test = confirm('Вам виповнилось 18?') ? 'Вірно' : 'Неправильно';
// console.log(test)

// 4. Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a = +prompt('Введіть число');
// if (a !== 0) {
// console.log('Вірно')
// } else {
//     console.log('Невірно')
// }

// 5. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
// let timetable = prompt('Введіть день тижня');
// switch (timetable) {
//     case ('Понеділок') :
//         document.write('1. Сніданок; 2. Пари в університеті; 3. Обід; 4. Лекція OKTEN; 5. Дз')
//         break;
//     case ('Вівторок') :
//         document.write('1. Сніданок; 2.Спортзал 3. Пари в університеті; 3. Обід; 4. Практичне заняття OKTEN');
//         break;
//     case ('Середа') :
//         document.write('1. Сніданок; 2. Пари в університеті; 3. Обід; 4. Спортзал 4. Лекція OKTEN');
//         break;
//     case ('Четвер') :
//         document.write('1. Сніданок; 2. Пари в університеті; 3. Обід; 4. Спортзал 4. Практичне заняття OKTEN');
//         break;
//     case ('П*ятниця') :
//         document.write('1. Сніданок; 2. Пари в університеті; 3. Обід; 4. Спортзал 4. Лекція OKTEN');
//         break;
//     default:
//         document.write('Такого дня не існує')
// }

// 6. Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year = +prompt('Введіть рік')
// if (year % 4 === 0) {
//     console.log('Високосний')
// } else {
//     console.log('Звичайний рік:)')
// }

// 7. Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let answer = prompt('Яка офіційна назва JavaScript?')
// if ('ECMAScript') {
//     console.log('Правильно!')
// } else {
//     console.log('Не знаєте? ECMAScript!')
// }